{
    "filename": "Data/sample/image.png",
    "extracted_text": "International Cardiac Care Centre\n\nAddress: No 397, Sivaparakasam Nagar, Chennai, Tamilnadu, 600066\nPhone: +31 9977676721\n\nPatient Health Report\n\nName Mr. Pratheop\nage Sa yoars\n\nGonder Male\n\nPatient 1D S0GC-2025-0456\nDatoot Admission 15-Aug-2025\nDate of Repart 20-Aug-2025\n\nPatient Mr. Pratheep, a 58-year-old mate with patient ID SCCO-2025-0456, was admitted on 15-Aug-\n2025 and this reports issued on 20-Aug-2025, He has a past medical history of hypertension for 10\nyears and type 2 diabetes melitus for 5 years, alongwith a family history of coronary artery disease.\nThe patient presented with shortness of breath on exertion, occasional chest pain (angina). and\nfatigue,\n\n‘On physical examination, his blood pressure was recorded at 150/95 mmHg, heart rate at 88 bam,\nrespiratory rate at 20 breaths per minute, temperature at 98.6°F, and BM| of 27 kg/m’. Laboratory\ninvestigations revealed an ECG showing ST-segment depression in ead Il I and aVF, and\nechocardiography indicated 3 left ventricular ejection fraction (LVEF) of 45%6 with mild left ventricular\nhynertrophy. Lipid profile showed total cholesteral of 240 mg/dL, LDL 160 mg/dL, HDL 38 mg/dL, and\ntriglycerides 180 mg/dL. Fasting blood sugar was 130 mg/dL and troponin | was slightly elovated at\n0.08 ng.\n\nBased on the clinical presentation and investigation results, the patientis diagnosed with chronic\nischemic heart disease, hypertensive heart disease, and dyslipidemia. The current treatment plan\nincludes aspirin 75 mg once daily, atorvastatin 20 mgt night, metoprolol 50 mg twice daily, and\nramipril S mg once daily Lifestyle modifications such as a low-salt dict, regular exercise, and smoking\ncessation have also been advised. The patient is recommended to have regular follow-ups every three\nmonths, moniter blood pressure and blood sugar daily, and undergo a cardiac stress testi angina\nsymptoms worsen.\n\n‘Attending Physician: Dr. Anjali Mehra, Senior Cardiologist\n"
}