{
    "filename": "Data/sample/image.png",
    "extracted_text": "BRR\n\nONCOLOGY REPORTS 54 Us, 2025\n\nSENP1: A perspective from immune cells to disease (Review)\n\nXIAOFANG FENG™\", GUOVU WU\" and QIYAN ZENG?\n\nDeparument of Nuclear Medicine, Minau Hospital of Guangai Zhuang Auanomows Region, Nanning Guangxi Zhuang\nAutonomous Regioa SHUO01. PR. China: “Department of Riachensisry and Melecula Biology. Schoo af Basic Medicine.\n(Goaogxi Medical Lniecsity, Nanning. Guangxi Zhuang Antonomous Region 53007] PR. Ching: ‘Key Laberatoy of Biological\nMolecular Medicine Research, Goangxi Medical University, Educaion Deparunen of Guangxi Zhuang Anlonemous Region,\n‘Nanoiog,Guangsi Zhuang Autonomous Region 530021, PR. Chis: ‘Deparment of Cardiotbcacie Surgery. Miazu Hospital of\n(Guangni Zhuang Awtonomoos Region. Nanoiog, Guangxi Zhuang Autonomous Region 530001, PR. China\n\nReceived Muy 16,2025; Accepted July 7, 2025\n\nDOM: 10.38920r2025.8947\n\nAbstract. Small ubiquitinlike modifier (SUMO) is a ubiq-\nuitin-like protein that modifies wrget proteins across various\nceukeryotic subcellular structures. This process, known as\nSUMO)lation, has been established as an essential reguls-\ntory mechunism that affects both the wtivity and positioning\nof proteins, maintaining cellular homeestasis. SUMOylation\nfund deSUMGylution are reversible post-trenslational\nmodification processes mediated by SUMO proteins and\nSUMO sentrin-specific proteases (SENPS). The human SENP\nfamily comprises six members, zach characterized by unique\ncellular localization and substrate specificity. The present\nreview primarily summarizes the role wnd mechanisms of\nSENPI in the development and maturation of irmune cells,\nincluding lymphocytes, macrophages and erythrocytes, #5\n\\well as its involvement in tumor cell invasion, metastasis,\ningiogenesis und resistance to pharmacologiea] therapies. In\nsudition, the introduction of SENPI inhibitors ws a Unerapeutic,\n\"pproach for cancer treatment is explored. Overall, the present\nstudy aimed to offer theoretical insights into eancer therapy\nstrategies that target SENPI\n\nContents\n\n1. Fotrduction\n2. SENP! in immune regulation\n\nCorrespondence to: Professor Qian Zeog, Department of\nBiochemistry aod Molecular Biology. School of Basic Medicine,\n‘Guangxi Medical University, 72 Shuangyong. Road. Gingxiu,\nNNanoing. Guangri Zhuang Alosomeus Region 340021, PR. China\nE-mail: 2eogan6hotmail com\n\n“Cantsbuted equally\n\nKey words: dSUMOsttion, SUMOenrin-specific protease 1,\nIme regulation. tumor\n\nSENPI und infection\nSSENPI nd tissue damage\n\nSENPI and tumors\n\nConclusion und future perspectives\n\nA.tutrodvetion\n\n‘Small ubiquitin-Like modifier (SUMO}ylation represents\nsignificant post-translational modification (PTM) facilitated\nby w limited number of specialized enaymes while exerting\ndymacnie regulation over a vasLarmay of target proteins. SUUMOs\n‘ean be conjugated to these turget proteins either as single\nmonomers or a5 vatious forms of polymeric structures (1.\n‘The human genome encodes five distinct SUMO proteins,\n‘pamely SUMOI, SUMG2, SUMQ3, SUMOS snd SUMOS Q)\n‘Among these, SUMON, SUMO? and SUMO3 constitute the\nisjr variunts exhibiting dstinet substrate specificity pris\nim PTM processes. For example, Ran GTPase activating\nprovin | isa canonical substrate for SUMOL, whereas topoi-\nsomerase II is primurily modified by SUMO2/3 (3.4), SUMO\nmolecules ure highly evolutionarily conserved und widely\n\nfound in protozoa, metuzoa, plants snd fungi (4). SUMO is\ncoupled as a monomer to lysine residues on substrate proteins,\nleading to mono-SUMOylation or muli-SUMOylation sehen\n‘multiple lysines are modified, and SUMOylaion often targets\nFunctionally related protein groups (). Current evidence bus\nsuggested Uhit un enaymatic cascade mediates SUMOylation\nthrough four distinct stages: Substrate maturation, E) activa-\ntion, E2 conjugation and 3 ligation. Intislly, SUMO-specific\nproteases (SENPS) cleave pro-SUMG proteins through\n(C-terminal truncation, releasing the conserved di-glycine\nmotif essential for functional activation of mature SUMO\n‘molecules, Following maturation, SUMO binds the catalytic\ncysteine of the El enzyme, liggering enzyme activation and\nthe establishment of a SUMO-EI comples. The SUMO protein\nis then tnensfrred to the E2 conjugating enzyme. Ulimately,\nthe BS ligase facilitates the transfer of SUMO from 2 tothe\nsubstrate lysine, catsly2ing isopeptide bond formation via a\nconserved catalytic wind 6.7) The outcomes of SUMO ylation\nencompass alterations in subcellular localization, modification\n"
}